example.yml
# Emulate 20 users sending two queries per second
# for 60 seconds.
config:
  target: "driver://user:pass@hostname/database"
  phases:
    arrivalCount: 10
    duration: 1
  engines:
    sql: {}

scenarios:
  - name: "SQL query"
    engine: "sql"
    flow:
      - count: 60
        loop:
        - query: "SELECT * from test"
        - think: 1